# Location Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCConnectedWallData..::..Location Property
IFCConnectedWallData Class See Also
---
The location for the join.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IFCConnectedWallDataLocation Location { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Location As IFCConnectedWallDataLocation
	Get
```

Visual C++
---
```text
public:
property IFCConnectedWallDataLocation Location {
	IFCConnectedWallDataLocation get ();
}
```

# See Also
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace